Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/pensions/occupational_pensions.html.txt.tmx
Source language: en
Languages: ga

source: Rules about pension schemes
ga: Na rialacha a bhaineann le scéimeanna pinsin

source: Pension schemes can, to a considerable extent, set their own rules about contributions and benefits
ga: Is féidir le scéimeanna pinsin a gcuid rialacha féin a shocrú maidir le ranníocaíochtaí agus sochair go pointe áirithe

source: There are some rules set out in legislation to which they must adhere
ga: Tá rialacha áirithe leagtha síos sa reachtaíocht agus caithfidh siad cloí leo seo

source: Preservation and Transfer of Benefits
ga: Caomhnú agus aistriú sochair

source: There are specific rules about what happens if you leave the pension scheme for whatever reason, for example, if you change jobs or you become self-employed or retire early without a pension
ga: Tá rialacha sainiúla leagtha síos má fhágann duine scéim phinsin ar chúis ar bith, mar shampla, má athraíonn duine a phost, nó má thógann duine suas féinfhostaíocht nó má éiríonn duine as an obair go luath, gan pinsean

source: Your benefits from the pension scheme may be preserved within the scheme or transferred to another scheme
ga: Is féidir sochair a chaomhnú laistigh den scéim nó iad a aistriú go dtí scéim eile

source: If you have at least 2 years service, you are entitled to a preserved benefit if you leave before the normal retirement age
ga: Má tá 2 bhliain seirbhíse déanta ag duine, tá an duine i dteideal sochair chaomhnaithe, fiú má fhágann sé/sí an post roimh an ghnáth aois dul amach ar phinsean

source: A preserved benefit means that you get a pension when you reach the scheme's normal retirement age
ga: Ciallaíonn sochar caomhnaithe go bhfaighidh an duine ansin pinsean nuair a shroicheann sé/sí gnáthaois pinsin a bhaineann leis an scéim sin

source: (Prior to 2 June 2002, 5 years service was needed to qualify for preservation)
ga: (Roimh 2 Meitheamh 2002, ní raibh mór duit 5 bhliain den tseirbhís a bheith agat chun cáiliú do chaomhnú

source: Alternatively, you can ask the trustees to transfer your pension rights to a new pension scheme
ga: Ach freisin, is féidir leat a iarraidh ar iontaobhaithe na scéime do chuid cearta pinsin a aistriú chuig scéim eile

source: The trustees are obliged to meet the minimum standards of funding for funded occupational schemes
ga: Tá sé de dhualgas ar na hiontaobhaithe na bunchaighdeán maonaithe a bhaineann le scéimeanna ceirde maonaithe a shásamh

source: Pension schemes usually have benefits for you when you retire and for your widowed spouse and dependent children after your death
ga: Bíonn sochair ag scéimeanna pinsin go hiondúil duit féin nuair a théann tú amach ar phinsean agus do do chéile bhaintrí agus do do chuid páistí cleithiúnacha tar éis do bháis

source: Not all schemes have arrangements for dependants
ga: Níl socruithe déanta do chleithiúnaithe sna scéimeanna uilig

source: Under an occupational pension scheme, the maximum benefit that can be provided for a spouse or dependent has been increased from 2/3 of the full pension to 100% of the provision
ga: Méadaíodh an t-uasmhéid socair soláthartha do chéile nó chleithiúnaí ó 2/3 iomlán pinsin go dtí 100% an tsoláthair

source: Some schemes may allow you to designate the person who should benefit under the scheme so it is possible, in some cases, to nominate a person other than a spouse
ga: D'fhéadfadh sé go mbeadh duine in ann le scéimeanna áirid an té a gheobhaidh na sochair faoin scéim a ainmniú agus mar sin, is féidir, i gcásanna áirid, duine a ainmniú seachas do chéile

source: Occupational pensions and marriage breakdown
ga: Pinsin gairme agus cliseadh pósta

source: In judicial separation and divorce proceedings, the court may make various types of financial settlements
ga: I gcásanna cúirte a bhaineann le scaradh agus colscaradh is féidir leis an gCúirt socruithe eagsúla airgeadais a dhéanamh

source: Among these is a Pension Adjustment Order
ga: Ina measc sin tá Ordú Leasú Pinsin

source: The Pension Adjustment Order designates a part of the pension for payment to a spouse (usually the wife) and dependant children
ga: Déanann Ordú Leasú Pinsin cuid den phinsean a thabhairt do chéile (go hiondúil an bhean) agus do na páistí cleithiúnacha

source: The judge decides how much of the pension should be designated
ga: Déanann an breitheamh an cinneadh cé mhéid den phinsean atá le tabhairt don chéile eile / do na páistí

source: The effect of such an order is that the designated part of the pension remains in the pension scheme but is payable to your spouse and children when you reach pension age or die
ga: Mar thoradh ar an ordú seo bíonn cuid ainmnithe den phinsean fágtha sa scéim phinsin ach tá sé iníoctha le do chéile agus do pháistí nuair a shroicheann tú aois an phinsin nó nuair a fhaigheann tú bás

source: Information about your own scheme is available from the trustees of the scheme
ga: Tá eolas faoi do scéim féin le fáil ó iontaobhaithe na scéime

source: Information on pensions generally and your rights is available from the Pensions Authority
ga: Soláthraíonn tÚdarás Pinsean eolas ar phinsin go ginearálta agus ar do chuid cearta pinsin
